ЛАБ8/lab8/app/controllers/example_controller.rb

SELECT "evqlid_results".* FROM "evqlid_results" WHERE "evqlid_results"."num1" = ? AND "evqlid_results"."num2" = ? LIMIT ?  [["num1", 1], ["num2", 1], ["LIMIT", 1]]
INSERT INTO "evqlid_results" ("num1", "num2", "nod", "nok", "created_at", "updated_at", "result1", "result2") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["num1", 18], ["num2", 19], ["nod", nil], ["nok", nil], ["created_at", "2022-12-10 10:35:03.582561"], ["updated_at", "2022-12-10 10:35:03.582561"], ["result1", nil], ["result2", nil]]
---
  def show
    @i = 0
    @summ = calc_sum
    if result1 = (EvqlidResult.find_by(num1: @input1 = params[:num1], num2: @input2 = params[:num2]) || EvqlidResult.find_by(num1: @input1 = params[:num2], num2: @input2 = params[:num1]))
      @result_fin = result1.decoded_res
    else
      result1 = EvqlidResult.new(num1: @input1, num2: @input2)
      if result1.save

SELECT "evqlid_results".* FROM "evqlid_results"
---
  def show_db
    # Задание с сериализацией
    # Для отрисовки в views/layouts/application.html.erb добавили <html data-turbo='false'>
    # render xml: EvqlidResult.all
    respond_to do |form|
      form.xml { render xml: EvqlidResult.all.map(&:to_xml) }