ЛАБ8/lab8/app/controllers/session_controller.rb

  def authorize
    user = User.find_by(name: params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "test_user"], ["LIMIT", 1]]