ЛАБ8/lab8/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)


    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Megachell"], ["password_digest", "[FILTERED]"], ["created_at", "2022-12-12 15:38:16.045293"], ["updated_at", "2022-12-12 15:38:16.045293"]]