ЛАБ8/lab8/app/models/evqlid_result.rb

  def unique_pair
    errors.add(:already_calculated, 'посчитано') unless
    EvqlidResult.find_by(num1: num2, num2: num1).nil?
---
SELECT "evqlid_results".* FROM "evqlid_results" WHERE "evqlid_results"."num1" = ? AND "evqlid_results"."num2" = ? LIMIT ?  [["num1", 1], ["num2", 1], ["LIMIT", 1]]

  def self.get(num1, num2)
    result = find_by(num1: num1, num2: num2)
    result = find_by(num1: num2, num2: num1) if result.blank?
---
SELECT "evqlid_results".* FROM "evqlid_results" WHERE "evqlid_results"."num1" = ? AND "evqlid_results"."num2" = ? LIMIT ?  [["num1", 1], ["num2", 18], ["LIMIT", 1]]

  def self.generate_result(num1, num2)
    iterations, nod, nok = calculating(num1, num2)

    res = create(num1: num2, num2: num2, nod: nod, nok: nok)

    iter_objects = iterations.reduce([]) do |sum, iteration|
      iter_res, index = iteration
      sum.push(EvqlidIteration.create(evqlid_result_id: res.id, iteration: index,
                                      num1: iter_res[0], num2: iter_res[1]))
---
INSERT INTO "evqlid_results" ("num1", "num2", "nod", "nok", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["num1", 1], ["num2", 1], ["nod", 18], ["nok", 1], ["created_at", "2022-12-10 12:57:26.352998"], ["updated_at", "2022-12-10 12:57:26.352998"]]
INSERT INTO "evqlid_iterations" ("iteration", "num1", "num2", "created_at", "updated_at", "evqlid_result_id") VALUES (?, ?, ?, ?, ?, ?)  [["iteration", 0], ["num1", 1], ["num2", 2], ["created_at", "2022-12-10 13:32:31.617025"], ["updated_at", "2022-12-10 13:32:31.617025"], ["evqlid_result_id", 8]]

  def self.calculating(num1, num2)
    results = calc_nod(num1, num2)
              .each_with_index
              .take_while { |res, _| [res[0], res[1]].min != 0 }

    nod = results.blank? ? num1 : results[-1][0].max
---
SELECT 1 AS one FROM "evqlid_results" WHERE "evqlid_results"."num1" = ? AND "evqlid_results"."num2" = ? LIMIT ?  [["num1", 1], ["num2", 1], ["LIMIT", 1]]